      *> Sample GnuCOBOL program
       identification division.
       program-id. hellonew.
       procedure division.
       display "Hello, new world!"
       end-display
           goback.
           stop run.
